scan/scan/bin/Release20160722/Release/Xmls/soap.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <SOAP-ENV:Body>
    <m:funMain xmlns:m="http://webservice.hospital.org/">
        <arg0>
          <![CDATA[]]>
       </arg0>
     </m:funMain>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>